# parameters
nc: 1  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# anchors Retinaface
anchors:
  - [19.2,16, 24.19,20.16, 30.48,25.40]  # P3/8
  - [38.40,32, 48.38,40.32, 60.96,50.80]  # P4/16_
  - [76.8,64, 96.76,80.63, 121.91,101.59]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, StemBlock, [64, 3, 2]],  # 0-P1/2
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],      # 2-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],      # 4-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],     # 6-P5/32
   [-1, 1, SPP, [1024, [3,5,7]]],
   [-1, 3, C3, [1024, False]],      # 8
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 12 ---> rf 14

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 16 ---> rf 6

   [-1, 1, Conv, [128, 1, 1 ]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[ -1, 1], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 20 (P3/8-small) ---> rf 2

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 23 (P4/16-medium) ---> rf 7

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512, False]],  # 26 (P5/32-large) ---> rf 14

   [20, 1, MultiSEAM, [128, 1, 3, [6, 7, 8], 16]],
   [-1, 1, Conv, [256, 1, 1]],  # 29
   [23, 1, MultiSEAM, [256, 1, 3, [6, 7, 8], 16]],
   [-1, 1, Conv, [512, 1, 1]],  # 31
   [26, 1, MultiSEAM, [512, 1, 3, [6, 7, 8], 16]],
   [-1, 1, Conv, [1024, 1, 1]],  # 33

   [[28, 30, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
